sfera3d/testSphere/system/acoDict/volDict3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      volDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

timeWindows 148;
timeStep 0.002;  

radius 8;
ndir 0;

domVol_y  0.06;
domVol_z  0.07;

mic_x  0.5;
mic_y  0.5;
mic_z  0.0;

rho 1000.0;
c0  1400.0;
u0  1.0;


inty 0.515;
intz 1.32;
x1  -3;
x2   5;
y1   1.0;
y2   2.0; 
domz 0.7;

// *********************************************************************** //

