sfera3d/testSphere/system/blockMeshDict
FoamFile
{
    version	 2.0;
    format	 ascii;
    class	 dictionary;
    object	 blockMeshDict;
}

convertToMeters	 1.0;

vertices
(
    ( -0.04   -0.08  -0.08 )  //0    
    (  0.12   -0.08  -0.08 )  //1
    (  0.12    0.08  -0.08 )  //2
    ( -0.04    0.08  -0.08 )  //3
    ( -0.04   -0.08   0.08 )  //4
    (  0.12   -0.08   0.08 )  //5
    (  0.12    0.08   0.08 )  //6
    ( -0.04    0.08   0.08 )  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 40) simpleGrading (1 1 1)
);

patches
(
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (1 2 6 5)
    )
    patch sides
    (
        (0 1 5 4)
        (2 3 7 6)
        (4 5 6 7)
        (0 3 2 1)
    )
);

mergPatchPairs
(
);
