sfera3d/testSphere/system/foamDataToFluentDict
1  /*--------------------------------*- C++ -*----------------------------------*\
2  | =========                     |                                             |    
3  | \\      /  F ield             | OpenFOAM:  The Open Source CFD Toolbox      |
4  |  \\    /   O peration         | Version:   2.4.                             |
5  |   \\  /    A nd               | Web:       www.OpenFOAM.org                 |
6  |    \\/     M anipulation      |                                             |
7  \*---------------------------------------------------------------------------*/
8   FoamFile
9   {
10    version   2.0;
11    format    ascii;
12    class     dictionary;
13    location  "system";
14    object    foamDataToFluentDict;
15  }
16   // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
17
18    p                    1;
19
20    U                    2;
21
22    T                    3;
23
24    h                    4;
25
26    k                    5;
27
28    epsilon              6;
29
30    alpha1             150;
31
32 
33
34   // ************************************************************************* //
