sfera3d/testSphere/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
   
// Fields to be probed. runTime modifiable!
   fields
   (
       p
   );
    
    // Locations to be probed. runTime modifiable!
    probeLocations
    (
                (  0.0    0.02  0.0)
                (  0.02   0.02  0.0)
//              (  0.06   0.02  0.0)
//              (  0.008  0.04  0.0)
//              (  0.02   0.04   0.0)
//              (  0.06   0.04   0.0)
//              (  0.008  0.06   0.0)
//              (  0.02   0.06   0.0)
                (  0.04   0.02   0.0)   

    );
    
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


